       IDENTIFICATION DIVISION.
       PROGRAM-ID. TAXCALC.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-TAX PIC 9(5)V99.
       PROCEDURE DIVISION USING LK-TAX.
       COMPUTE-TAX SECTION.
       DO-COMPUTE.
           COMPUTE LK-TAX = 100.
           CALL 'AUDITLOG'.
           GOBACK.
