       IDENTIFICATION DIVISION.
       PROGRAM-ID. CMT.
      * COPY SHOULDSKIP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CUSTREC.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY 'X'.
