       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY 'HELLO'.
           PERFORM SUB-PARA.
           STOP RUN.
       SUB-PARA.
           DISPLAY 'SUB'.
