       IDENTIFICATION DIVISION.
       PROGRAM-ID. WITHCOPY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CUSTREC.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY 'X'.
