       IDENTIFICATION DIVISION.
       PROGRAM-ID. WITHSEC.
       PROCEDURE DIVISION.
       A-SECTION SECTION.
       A-PARA.
           PERFORM B-PARA.
       B-PARA.
           DISPLAY 'B'.
       C-SECTION SECTION.
       C-PARA.
           DISPLAY 'C'.
